In [1]:
a_tuple = 1,2,3

In [2]:
len(a_tuple)

3

In [3]:
a_tuple = 1, 100
a, b  = a_tuple
a, b = b, a
print(a, b)

100 1

In [2]:
card_id = {"first name" : "Paul",
           "last name" : "Lefebvre",
           "emission" : 1978}

In [3]:
card_id

{'first name': 'Paul', 'last name': 'Lefebvre', 'emission': 1978}

In [4]:
card_id['first name']

'Paul'

In [5]:
card_id['last name']

'Lefebvre'

TypeError: 'dict_items' object is not subscriptable

In [18]:
card_id.keys

In [20]:
card_id.keys()

dict_keys(['first name', 'last name', 'emission'])

In [24]:
card_id.values()

dict_values(['Paul', 'Lefebvre', 1978])

In [25]:
card_id.values()[0]

TypeError: 'dict_values' object is not subscriptable

In [9]:
card_id.items()

dict_items([('first name', 'Paul'), ('last name', 'Lefebvre'), ('emission', 1978)])

In [11]:
lst_keys = []
lst_values = []
for k, v in card_id.items():
    lst_keys.append(k)
    lst_values.append(v)

lst_values

['Paul', 'Lefebvre', 1978]

In [16]:
lst_keys = [k for k in card_id.keys()]
lst_values = [v for v in card_id.values()]

['Paul', 'Lefebvre', 1978]

In [21]:
lst_tuple = [(k,v) for k, v in card_id.items()]
lst_tuple

[('first name', 'Paul'), ('last name', 'Lefebvre'), ('emission', 1978)]

In [26]:
text = ["the", "word", "the", "is", "the", "word", "of", "which", "we", "search", "the", "position"]
enumerate(text)

<enumerate object at 0x10ec294e0>

In [29]:
help(enumerate)

Help on class enumerate in module builtins:

class enumerate(object)
 |  enumerate(iterable, start=0)
 |
 |  Return an enumerate object.
 |
 |    iterable
 |      an object supporting iteration
 |
 |  The enumerate object yields pairs containing a count (from start, which
 |  defaults to zero) and a value yielded by the iterable argument.
 |
 |  enumerate is useful for obtaining an indexed list:
 |      (0, seq[0]), (1, seq[1]), (2, seq[2]), ...
 |
 |  Methods defined here:
 |
 |  __getattribute__(self, name, /)
 |      Return getattr(self, name).
 |
 |  __iter__(self, /)
 |      Implement iter(self).
 |
 |  __next__(self, /)
 |      Implement next(self).
 |
 |  __reduce__(...)
 |      Return state information for pickling.
 |
 |  ----------------------------------------------------------------------
 |  Class methods defined here:
 |
 |  __class_getitem__(...) from builtins.type
 |      See PEP 585
 |
 |  ----------------------------------------------------------------------
 |  Static methods defined here:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.

In [30]:
for n, e in enumerate(text):
    print(n,e)

0 the
1 word
2 the
3 is
4 the
5 word
6 of
7 which
8 we
9 search
10 the
11 position

In [ ]:


    The exercise is composed of several questions, follow the order and be careful to respect the names of the variables. Do not hesitate to contact the DataScientest team if you face any issue help@datascientest.com
    Exploring the dataset

    This evaluation focuses on the heart_disease.csv dataset. This dataset contains information and medical results for just over 300 patients. The variable target indicates whether a patient has (1) or not (0) heart disease.
    The main objective of the exam is to use data processing methods and a classification algorithm to predict whether a patient has heart disease or not.

    (a) Read the file heart_disease.csv in a DataFrame called df specifying that the first column contains the indices

    (b) Display an overview and a first description of the variables in the dataset

In [50]:
dict1 = {'id' : [1,2,3,4,5],
         'age' : [63, 37, 41, 56, 57],
         'sex' : ['Male', 'Male', 'Female', 'Male', 'Female'],
         'tha' : [150, 180, np.nan, 178,163 ],
         'target' : [1,1,1,np.nan, 0]}

df = pd.DataFrame(dict1)
df

   id  age     sex    tha  target
0   1   63    Male  150.0     1.0
1   2   37    Male  180.0     1.0
2   3   41  Female    NaN     1.0
3   4   56    Male  178.0     NaN
4   5   57  Female  163.0     0.0

In [51]:
df.loc[df.age == df.age.max()].sex[0]

'Male'

In [52]:
df.isna().sum()

id        0
age       0
sex       0
tha       1
target    1
dtype: int64

In [55]:
df.dropna(axis=0, subset=['target'])

   id  age     sex    tha  target
0   1   63    Male  150.0     1.0
1   2   37    Male  180.0     1.0
2   3   41  Female    NaN     1.0
4   5   57  Female  163.0     0.0

In [58]:
df.dropna(axis=0, how='any', subset=['tha'])

   id  age     sex    tha  target
0   1   63    Male  150.0     1.0
1   2   37    Male  180.0     1.0
3   4   56    Male  178.0     NaN
4   5   57  Female  163.0     0.0

In [59]:
def normalization_min_max(X):
    if X.ndim == 1:
        l2 = []
        for i in X:
            new_i = (i - min(X)) / (max(X) - min(X))
            l2.append(round(new_i, 2))
        return l2
    else:
        X = X.T
        for i, row in enumerate(X):
            mi = min(row)
            ma = max(row)
            for j, value in enumerate(row):
                new_value = (value - mi) / (ma - mi)
                X[i,j] = round(new_value, 2)

        return X.T

In [62]:
df_norm = df.replace(('Male', 'Female'), (1,0)).apply(normalization_min_max)
df_norm

     id   age  sex   tha  target
0  0.00  1.00  1.0  0.00     1.0
1  0.25  0.00  1.0  1.00     1.0
2  0.50  0.15  0.0   NaN     1.0
3  0.75  0.73  1.0  0.93     NaN
4  1.00  0.77  0.0  0.43     0.0

In [63]:
# original cozum
def normalization_min_max2(X):
    # Initialization of X_tilde
    X_tilde = np.zeros(shape = X.shape)
    
    # For each column of X
    for j, column in enumerate(X.T):
        # Initialization of the minimum and maximum of the column
        min_Xj = column[0]
        max_Xj = column[0]
        
        # For each value in the column
        for value in column:
            # If the value is SMALLER than the min
            if value < min_Xj:
                # We overwrite the min with this value
                min_Xj = value
            
            # If the value is GREATER than the max
            if value > max_Xj:
                # We overwrite the max with this value
                max_Xj = value
                
        # We can now calculate X_tilde for this column
        # Broadcasting allows us to do this without a for loop
        X_tilde[:, j] = (X[:, j] - min_Xj)/(max_Xj - min_Xj)
            
    return X_tilde

In [69]:
df_01 = df.replace(('Male', 'Female'), (1,0))

X = df_01.iloc[:, :-1]
X

   id  age  sex    tha
0   1   63    1  150.0
1   2   37    1  180.0
2   3   41    0    NaN
3   4   56    1  178.0
4   5   57    0  163.0

In [70]:
y = df_01['target']
y

0    1.0
1    1.0
2    1.0
3    NaN
4    0.0
Name: target, dtype: float64

In [73]:
X_norm = X.apply(normalization_min_max)
X_norm

     id   age  sex   tha
0  0.00  1.00  1.0  0.00
1  0.25  0.00  1.0  1.00
2  0.50  0.15  0.0   NaN
3  0.75  0.73  1.0  0.93
4  1.00  0.77  0.0  0.43

In [75]:
X = np.array([[24, 1.88],
              [18, 1.68],
              [14, 1.65]])

normalization_min_max2(X_norm)

TypeError: 'int' object is not subscriptable